// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243  ;2, 4 -> 16

Console.WriteLine("Hello, World!");
